Revit 2024 API
FamilyType.HasValue Method
Indicates if this family parameter has an assigned value or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool HasValue(
	FamilyParameter familyParameter
)
Visual Basic
Public Function HasValue ( _
	familyParameter As FamilyParameter _
) As Boolean
Visual C++
public:
bool HasValue(
	FamilyParameter^ familyParameter
)
Parameters
familyParameter
Type: Autodesk.Revit.DB.FamilyParameter
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown if the input argument-"familyParameter"-is invalid.
See Also
FamilyType Class
Autodesk.Revit.DB Namespace